{ "_id" : { "$oid" : "528eded0a54d75047be8d082" }, "description" : "Windows 3.1x (codenamed Janus) is a series of 16-bit operating systems, produced by Microsoft for use on personal computers. The series began with Windows 3.1, which was first sold during March 1992 as a successor to Windows 3.0. Subsequent versions were released between 1992 and 1994 until the series was superseded by Windows 95. During its lifespan, Windows 3.1 introduced various enhancements to the still MS-DOS-based platform, including improved system stability, expanded support for multimedia, TrueType fonts, and workgroup networking.", "developer2_id" : { "$oid" : "528ed940a54d7503ea4670a3" }, "image" : "images/projects/win31.jpg", "comments" : [], "sponsor_name" : "Bill Gates", "developer3_id" : { "$oid" : "528eda18a54d7503ea4670a7" }, "name" : "Windows 3.1", "platforms" : [ "Assembly" ], "semester" : "Fall 2013", "developer4_id" : { "$oid" : "528ed9e1a54d7503ea4670a5" }, "likes" : 1, "sponsor_website" : "", "developer1_id" : { "$oid" : "528ed8c2a54d7503ea4670a1" }, "date_published" : { "$date" : 438305568000 }, "developer0_id" : { "$oid" : "528eda48a54d7503ea4670a9" } }
{ "_id" : { "$oid" : "528edf4da54d75047be8d084" }, "description" : "Windows 95 is a consumer-oriented graphical user interface-based operating system. It was released on August 24, 1995 by Microsoft,[2][3] and was a significant progression from the company's previous Windows products. During development, it was referred to as Windows 4.0 or by the internal codename Chicago.\r\nWindows 95 integrated Microsoft's formerly separate MS-DOS and Windows products. It featured significant improvements over its predecessor, Windows 3.1, most notably in the graphical user interface (GUI) and in its relatively simplified \"plug-n-play\" features. There were also major changes made at lower levels of the operating system, such as moving from a mainly 16-bit architecture to a pre-emptively multitasked 32-bit architecture.\r\n", "developer2_id" : { "$oid" : "528ed9e1a54d7503ea4670a5" }, "image" : "images/projects/win95.jpg", "comments" : [], "sponsor_name" : "Bill Gates", "developer3_id" : null, "name" : "Windows 95", "platforms" : [ "Assembly" ], "semester" : "Winter 1995", "developer4_id" : { "$oid" : "528ed8c2a54d7503ea4670a1" }, "likes" : 6, "sponsor_website" : "", "developer1_id" : { "$oid" : "528edaf2a54d7503ea4670af" }, "date_published" : { "$date" : 816996938000 }, "developer0_id" : { "$oid" : "528edabfa54d7503ea4670ad" } }
{ "_id" : { "$oid" : "528ee229a54d75047be8d086" }, "likes" : 0, "developer2_id" : null, "date_published" : { "$date" : 911692091000 }, "developer0_id" : { "$oid" : "528ed9e1a54d7503ea4670a5" }, "image" : "images/projects/win98.jpg", "description" : "Windows 98 (codenamed Memphis) is a graphical operating system by Microsoft. It is the second major release in the Windows 9x line of operating systems. It was released to manufacturing on May 15, 1998 and to retail on June 25, 1998. Windows 98 is the successor to Windows 95. Like its predecessor, it is a hybrid 16-bit/32-bit[2] monolithic product with an MS-DOS based boot stage.[3] Windows 98 was succeeded by Windows 98 Second Edition on May 5, 1999, then by Windows ME (Millennium Edition) on September 14, 2000. Microsoft ended support for Windows 98 on July 11, 2006.\r\n", "sponsor_name" : "Bill Gates", "comments" : [], "platforms" : [ "C", "Assembly" ], "semester" : "fall 1998", "developer4_id" : null, "developer3_id" : null, "sponsor_website" : "", "developer1_id" : { "$oid" : "528ed851a54d7503ea46709f" }, "name" : "Windows 98" }
{ "_id" : { "$oid" : "528ee2a2a54d75047be8d088" }, "likes" : 0, "developer2_id" : { "$oid" : "528ed940a54d7503ea4670a3" }, "date_published" : { "$date" : 1069458594000 }, "developer0_id" : { "$oid" : "528ed851a54d7503ea46709f" }, "image" : "images/projects/win_xp.jpg", "description" : "Windows XP is an operating system produced by Microsoft for use on personal computers, including home and business desktops, laptops and media centers. First released to computer manufacturers on August 24, 2001,[5] it is the second most popular version of Windows, based on installed user base.[6] The name \"XP\" is short for \"eXPerience\",[7] highlighting the enhanced user experience.[8]\r\n", "sponsor_name" : "Bill Gates", "comments" : [], "platforms" : [], "semester" : "Summer 2003", "developer4_id" : null, "developer3_id" : { "$oid" : "528edaf2a54d7503ea4670af" }, "sponsor_website" : "", "developer1_id" : { "$oid" : "528ed9e1a54d7503ea4670a5" }, "name" : "Windows XP" }
{ "_id" : { "$oid" : "528ee34fa54d75047be8d08a" }, "name" : "Windows Vista", "developer2_id" : { "$oid" : "528edabfa54d7503ea4670ad" }, "date_published" : { "$date" : 1195689176000 }, "image" : "images/projects/win_vista.jpg", "description" : "Windows Vista is an operating system by Microsoft for use on personal computers, including home and business desktops, laptops, tablet PCs, and media center PCs. Prior to its announcement on July 22, 2005, Windows Vista was known by its codename \"Longhorn\".[4] Development was completed on November 8, 2006, and over the following three months, it was released in stages to computer hardware and software manufacturers, business customers and retail channels. On January 30, 2007, it was released worldwide[5] and was made available for purchase and download from Microsoft's website.[6] The release of Windows Vista came more than five years after the introduction of its predecessor, Windows XP, the longest time span between successive releases of Microsoft Windows desktop operating systems. It was succeeded by Windows 7, which was released to manufacturing on July 22, 2009 and released worldwide for retail on October 22, 2009.\r\n", "sponsor_name" : "Bill Gates", "developer3_id" : null, "platforms" : [], "semester" : "Winter 2007", "developer4_id" : null, "likes" : 1, "sponsor_website" : "", "developer1_id" : { "$oid" : "528ed851a54d7503ea46709f" }, "comments" : [], "developer0_id" : { "$oid" : "528eda18a54d7503ea4670a7" } }
{ "_id" : { "$oid" : "528ee42ea54d75047be8d08c" }, "name" : "Windows 7", "developer2_id" : { "$oid" : "528eda6da54d7503ea4670ab" }, "date_published" : { "$date" : 1227311800000 }, "image" : "images/projects/win7.jpg", "description" : "Windows 7 is an operating system produced by Microsoft for use on personal computers, including home and business desktops, laptops, netbooks, tablet PCs, and media center PCs.[6] It was released to manufacturing on July 22, 2009,[7] and became generally available for retail worldwide on October 22, 2009,[8] less than three years after the release of its predecessor, Windows Vista. Windows 7's server counterpart, Windows Server 2008 R2, was released at the same time. Windows 7 is succeeded by Windows 8.\r\n", "sponsor_name" : "Bill Gates", "developer3_id" : { "$oid" : "528ed8c2a54d7503ea4670a1" }, "platforms" : [ "C", "C++" ], "semester" : "Winter 2008", "developer4_id" : null, "likes" : 4, "sponsor_website" : "", "developer1_id" : { "$oid" : "528edabfa54d7503ea4670ad" }, "comments" : [], "developer0_id" : { "$oid" : "528eda18a54d7503ea4670a7" } }
{ "_id" : { "$oid" : "528ee475a54d75047be8d08e" }, "name" : "Windows 8", "developer2_id" : { "$oid" : "528ed940a54d7503ea4670a3" }, "date_published" : { "$date" : 1321919884000 }, "image" : "images/projects/windows8.jpg", "description" : "Windows 8 is a personal computer operating system developed by Microsoft as part of Windows NT family of operating systems. Development of Windows 8 started before the release of its predecessor, Windows 7, in 2009. It was announced at CES 2011, and followed by the release of three pre-release versions from September 2011 to May 2012. The operating system was released to manufacturing on August 1, 2012, and was released for general availability on October 26, 2012.[4]\r\nWindows 8 introduced major changes to the operating system's platform and user interface to improve its user experience on tablets, where Windows was now competing with mobile operating systems, including Android and iOS.[5] In particular, these changes included a touch-optimized Windows shell based on Microsoft's \"Metro\" design language, the Start screen (which displays programs and dynamically updated content on a grid of tiles), a new platform for developing apps with an emphasis on touchscreen input, integration with online services (including the ability to sync apps and settings between devices), and Windows Store, an online store for downloading and purchasing new software. Windows 8 added support for USB 3.0, Advanced Format hard drives, near field communications, and cloud computing. Additional security features were introduced, such as built-in antivirus software, integration with Microsoft SmartScreen phishing filtering service and support for UEFI Secure Boot on supported devices with UEFI firmware, to prevent malware from infecting the boot process.\r\n", "sponsor_name" : "Bill Gates", "developer3_id" : null, "platforms" : [ "Assembly" ], "semester" : "Summer 2011", "developer4_id" : null, "likes" : 1, "sponsor_website" : "", "developer1_id" : { "$oid" : "528eda48a54d7503ea4670a9" }, "comments" : [ "this is a comment", "another comment" ], "developer0_id" : { "$oid" : "528eda6da54d7503ea4670ab" } }
